# SpotCoordinateIncludeElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotCoordinateIncludeElevation Property
ParameterTypeId Class See Also
---
"Include Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotCoordinateIncludeElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotCoordinateIncludeElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotCoordinateIncludeElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace